open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_apctl_main.c
/****************************************************************************
 * contest2026_135_yongwangzhiqian/app/bk7258/bk7258_apctl_main.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <arch/chip/bk7258_amp.h>
#ifdef CONFIG_BK7258_RPTUN_MBOX
#  include <arch/chip/bk7258_rptun.h>
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static const char *apctl_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_AP_STATE_OFF:
        return "OFF";
      case BK7258_AP_STATE_STARTING:
        return "STARTING";
      case BK7258_AP_STATE_READY:
        return "READY";
      case BK7258_AP_STATE_STOPPING:
        return "STOPPING";
      case BK7258_AP_STATE_STOPPED:
        return "STOPPED";
      case BK7258_AP_STATE_FAILED:
        return "FAILED";
      default:
        return "UNKNOWN";
    }
}

#ifdef CONFIG_BK7258_RPTUN
static const char *apctl_rptun_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_RPTUN_STATE_OFFLINE:
        return "OFFLINE";
      case BK7258_RPTUN_STATE_PREPARING:
        return "PREPARING";
      case BK7258_RPTUN_STATE_TABLE_READY:
        return "TABLE_READY";
      case BK7258_RPTUN_STATE_CONNECTING:
        return "CONNECTING";
      case BK7258_RPTUN_STATE_CONNECTED:
        return "CONNECTED";
      case BK7258_RPTUN_STATE_QUIESCING:
        return "QUIESCING";
      case BK7258_RPTUN_STATE_FAULTED:
        return "FAULTED";
      default:
        return "UNKNOWN";
    }
}
#endif

#ifdef CONFIG_BK7258_AP_SUPERVISOR
static const char *apctl_supervisor_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_AP_SUPERVISOR_OFFLINE:
        return "OFFLINE";
      case BK7258_AP_SUPERVISOR_ARMING:
        return "ARMING";
      case BK7258_AP_SUPERVISOR_HEALTHY:
        return "HEALTHY";
      case BK7258_AP_SUPERVISOR_SUSPECT:
        return "SUSPECT";
      case BK7258_AP_SUPERVISOR_FAULTED:
        return "FAULTED";
      case BK7258_AP_SUPERVISOR_RECOVERING:
        return "RECOVERING";
      case BK7258_AP_SUPERVISOR_LOCKOUT:
        return "LOCKOUT";
      default:
        return "UNKNOWN";
    }
}

static const char *apctl_supervisor_reason_name(uint32_t reason)
{
  switch (reason)
    {
      case BK7258_AP_SUPERVISOR_REASON_NONE:
        return "NONE";
      case BK7258_AP_SUPERVISOR_REASON_BAD_SHARED_STATE:
        return "BAD_SHARED_STATE";
      case BK7258_AP_SUPERVISOR_REASON_AP_REPORTED_FAILURE:
        return "AP_REPORTED_FAILURE";
      case BK7258_AP_SUPERVISOR_REASON_AP_EXCEPTION:
        return "AP_EXCEPTION";
      case BK7258_AP_SUPERVISOR_REASON_PRIMARY_TIMEOUT:
        return "PRIMARY_TIMEOUT";
      case BK7258_AP_SUPERVISOR_REASON_SECONDARY_TIMEOUT:
        return "SECONDARY_TIMEOUT";
      case BK7258_AP_SUPERVISOR_REASON_RPTUN_DISCONNECTED:
        return "RPTUN_DISCONNECTED";
      case BK7258_AP_SUPERVISOR_REASON_RPMSG_TIMEOUT:
        return "RPMSG_TIMEOUT";
      case BK7258_AP_SUPERVISOR_REASON_RECOVERY_FAILED:
        return "RECOVERY_FAILED";
      default:
        return "UNKNOWN";
    }
}

static const char *apctl_supervisor_injection_name(uint32_t injection)
{
  switch (injection)
    {
      case BK7258_AP_SUPERVISOR_INJECT_NONE:
        return "NONE";
      case BK7258_AP_SUPERVISOR_INJECT_PRIMARY:
        return "PRIMARY";
      case BK7258_AP_SUPERVISOR_INJECT_SECONDARY:
        return "SECONDARY";
      case BK7258_AP_SUPERVISOR_INJECT_RPMSG:
        return "RPMSG";
      default:
        return "UNKNOWN";
    }
}

static int apctl_supervisor_status(void)
{
  struct bk7258_ap_supervisor_status_s status;
  int ret;

  memset(&status, 0, sizeof(status));
  ret = bk7258_ap_supervisor_get_status(&status);
  if (ret < 0)
    {
      printf("AP supervisor unavailable: %d\n", ret);
      return ret;
    }

  printf("AP supervisor state=%s(%" PRIu32 ") reason=%s(%" PRIu32
         ") generation=%" PRIu32 " flags=%08" PRIx32 "\n",
         apctl_supervisor_state_name(status.state), status.state,
         apctl_supervisor_reason_name(status.reason), status.reason,
         status.generation, status.flags);
  printf("Supervisor heartbeat primary/secondary=%" PRIu32 "/%" PRIu32
         " age=%" PRIu32 "/%" PRIu32
         " ms transport seq/age=%" PRIu32 "/%" PRIu32
         " ms healthy/sample=%" PRIu32 "/%" PRIu32
         " ms sample_sequence=%" PRIu32 "\n",
         status.primary_heartbeat, status.secondary_heartbeat,
         status.primary_age_ms, status.secondary_age_ms,
         status.transport_sequence, status.transport_age_ms,
         status.healthy_age_ms, status.sample_age_ms,
         status.sample_sequence);
  printf("Supervisor faults/recoveries/consecutive=%" PRIu32 "/%" PRIu32
         "/%" PRIu32 " injection=%s(%" PRIu32
         ") last_error=%" PRId32 "\n",
         status.fault_count, status.recovery_count,
         status.consecutive_failures,
         apctl_supervisor_injection_name(status.injection),
         status.injection, status.last_error);

  if ((status.flags & BK7258_AP_SUPERVISOR_FLAG_FAULT_SAVED) != 0)
    {
      printf("Supervisor fault generation/exception=%" PRIu32 "/%" PRIu32
             " HFSR/CFSR=%08" PRIx32 "/%08" PRIx32
             " PC/LR=%08" PRIx32 "/%08" PRIx32 "\n",
             status.fault_generation, status.fault_exception,
             status.fault_hfsr, status.fault_cfsr,
             status.fault_pc, status.fault_lr);
    }

  return status.state == BK7258_AP_SUPERVISOR_HEALTHY ? OK : -EHOSTDOWN;
}
#endif

static const char *apctl_cpu2_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_CPU2_PROBE_STATE_OFF:
        return "OFF";
      case BK7258_CPU2_PROBE_STATE_STARTING:
        return "STARTING";
      case BK7258_CPU2_PROBE_STATE_READY:
        return "READY";
      case BK7258_CPU2_PROBE_STATE_STOPPING:
        return "STOPPING";
      case BK7258_CPU2_PROBE_STATE_STOPPED:
        return "STOPPED";
      case BK7258_CPU2_PROBE_STATE_FAILED:
        return "FAILED";
      case BK7258_CPU2_PROBE_STATE_BOOTSTRAP:
        return "BOOTSTRAP";
      case BK7258_CPU2_PROBE_STATE_SECONDARY_READY:
        return "SECONDARY_READY";
      case BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE:
        return "SCHEDULER_ONLINE";
      default:
        return "UNKNOWN";
    }
}

static const char *apctl_ipi_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_AP_IPI_STATE_OFF:
        return "OFF";
      case BK7258_AP_IPI_STATE_INITIALIZING:
        return "INITIALIZING";
      case BK7258_AP_IPI_STATE_READY:
        return "READY";
      case BK7258_AP_IPI_STATE_REQUESTED:
        return "REQUESTED";
      case BK7258_AP_IPI_STATE_RUNNING:
        return "RUNNING";
      case BK7258_AP_IPI_STATE_PASSED:
        return "PASSED";
      case BK7258_AP_IPI_STATE_FAILED:
        return "FAILED";
      case BK7258_AP_IPI_STATE_STOPPED:
        return "STOPPED";
      default:
        return "UNKNOWN";
    }
}

static const char *apctl_smp_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_AP_SMP_STATE_OFF:
        return "OFF";
      case BK7258_AP_SMP_STATE_INITIALIZING:
        return "INITIALIZING";
      case BK7258_AP_SMP_STATE_ONLINE:
        return "ONLINE";
      case BK7258_AP_SMP_STATE_TESTING:
        return "TESTING";
      case BK7258_AP_SMP_STATE_PASSED:
        return "PASSED";
      case BK7258_AP_SMP_STATE_FAILED:
        return "FAILED";
      default:
        return "UNKNOWN";
    }
}

static const char *apctl_affinity_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_AP_AFFINITY_STATE_OFF:
        return "OFF";
      case BK7258_AP_AFFINITY_STATE_INITIALIZING:
        return "INITIALIZING";
      case BK7258_AP_AFFINITY_STATE_DISPATCHING:
        return "DISPATCHING";
      case BK7258_AP_AFFINITY_STATE_RUNNING:
        return "RUNNING";
      case BK7258_AP_AFFINITY_STATE_PASSED:
        return "PASSED";
      case BK7258_AP_AFFINITY_STATE_FAILED:
        return "FAILED";
      default:
        return "UNKNOWN";
    }
}

static const char *apctl_sem_wake_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_AP_SEM_WAKE_STATE_OFF:
        return "OFF";
      case BK7258_AP_SEM_WAKE_STATE_INITIALIZING:
        return "INITIALIZING";
      case BK7258_AP_SEM_WAKE_STATE_WAITING:
        return "WAITING";
      case BK7258_AP_SEM_WAKE_STATE_BLOCKED:
        return "BLOCKED";
      case BK7258_AP_SEM_WAKE_STATE_POSTED:
        return "POSTED";
      case BK7258_AP_SEM_WAKE_STATE_WOKEN:
        return "WOKEN";
      case BK7258_AP_SEM_WAKE_STATE_PASSED:
        return "PASSED";
      case BK7258_AP_SEM_WAKE_STATE_FAILED:
        return "FAILED";
      default:
        return "UNKNOWN";
    }
}

