open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_apctl_main.c
static const char *apctl_sem_wake_loop_state_name(uint32_t state)
{
  switch (state)
    {
      case BK7258_AP_SEM_WAKE_LOOP_STATE_OFF:
        return "OFF";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_INITIALIZING:
        return "INITIALIZING";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_WAITING:
        return "WAITING";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_BLOCKED:
        return "BLOCKED";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_POSTED:
        return "POSTED";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_WOKEN:
        return "WOKEN";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_CONTINUE:
        return "CONTINUE";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_PASSED:
        return "PASSED";
      case BK7258_AP_SEM_WAKE_LOOP_STATE_FAILED:
        return "FAILED";
      default:
        return "UNKNOWN";
    }
}

static const char *apctl_adv_state_name(uint32_t state)
{
  switch (state)
    {
      case 0:
        return "OFF";
      case 1:
        return "INITIALIZING";
      case 2:
        return "RUNNING";
      case 3:
        return "PASSED";
      case 4:
        return "FAILED";
      default:
        return "UNKNOWN";
    }
}

static void apctl_print_advanced(
  const char *label,
  const volatile struct bk7258_ap_advanced_state_s *shared)
{
  struct bk7258_ap_advanced_state_s local;

  if (shared->magic == 0 || shared->size != sizeof(local))
    {
      return;
    }

  memcpy(&local, (const void *)(uintptr_t)shared, sizeof(local));
  if (local.version == 0)
    {
      return;
    }

  printf("AP %s state=%s(%" PRIu32 ") error=%" PRIu32
         " generation=%" PRIu32 " req/compl=%" PRIu32 "/%" PRIu32 "\n",
         label, apctl_adv_state_name(local.state), local.state,
         local.error, local.generation, local.requested, local.completed);
  printf("%s task[0] id/cpu=%" PRIu32 "/%" PRIu32
         " started/completed=%" PRIu32 "/%" PRIu32
         " seq=%" PRIu32 " val=%" PRId32 "/%" PRId32 "\n",
         label, local.task_id[0], local.task_cpu[0],
         local.task_started[0], local.task_completed[0],
         local.sequence[0], local.value[0], local.value[1]);
  printf("%s task[1] id/cpu=%" PRIu32 "/%" PRIu32
         " started/completed=%" PRIu32 "/%" PRIu32
         " seq=%" PRIu32 "\n",
         label, local.task_id[1], local.task_cpu[1],
         local.task_started[1], local.task_completed[1],
         local.sequence[1]);
  printf("%s SMP tx0=%" PRIu32 "->%" PRIu32
         " rx1=%" PRIu32 "->%" PRIu32
         " tx1=%" PRIu32 "->%" PRIu32
         " rx0=%" PRIu32 "->%" PRIu32 "\n",
         label, local.smp_tx0_before, local.smp_tx0_after,
         local.smp_rx1_before, local.smp_rx1_after,
         local.smp_tx1_before, local.smp_tx1_after,
         local.smp_rx0_before, local.smp_rx0_after);
  printf("%s calls=%" PRIu32 "->%" PRIu32
         " aux=%" PRIu32 "/%" PRIu32 "\n",
         label, local.calls_before, local.calls_after,
         local.aux[0], local.aux[1]);
}

static uint32_t apctl_u32(const char *value, uint32_t fallback)
{
  char *end;
  unsigned long parsed;

  if (value == NULL)
    {
      return fallback;
    }

  parsed = strtoul(value, &end, 0);
  if (*value == '\0' || *end != '\0' || parsed > UINT32_MAX)
    {
      return fallback;
    }

  return (uint32_t)parsed;
}

static void apctl_status(void)
{
  struct bk7258_ap_boot_state_s state;
  struct bk7258_ap_fault_state_s fault;
#ifdef CONFIG_BK7258_RPTUN
  struct bk7258_rptun_control_s rptun;
#endif
  struct bk7258_cpu2_probe_state_s cpu2;
  struct bk7258_ap_ipi_state_s ipi;
  struct bk7258_ap_smp_state_s smp;
  struct bk7258_ap_affinity_state_s affinity;
  struct bk7258_ap_sem_wake_state_s sem_wake;
  struct bk7258_ap_sem_wake_loop_state_s sem_loop;
  volatile struct bk7258_cpu2_probe_state_s *shared_cpu2 =
    bk7258_cpu2_probe_state();
  volatile struct bk7258_ap_fault_state_s *shared_fault =
    bk7258_ap_fault_state();
  volatile struct bk7258_ap_ipi_state_s *shared_ipi =
    bk7258_ap_ipi_state();
  volatile struct bk7258_ap_smp_state_s *shared_smp =
    bk7258_ap_smp_state();
  volatile struct bk7258_ap_affinity_state_s *shared_affinity =
    bk7258_ap_affinity_state();
  volatile struct bk7258_ap_sem_wake_state_s *shared_sem_wake =
    bk7258_ap_sem_wake_state();
  volatile struct bk7258_ap_sem_wake_loop_state_s *shared_sem_loop =
    bk7258_ap_sem_wake_loop_state();
#ifdef CONFIG_BK7258_RPTUN
  volatile struct bk7258_rptun_control_s *shared_rptun =
    bk7258_rptun_control();
#endif

  bk7258_ap_get_status(&state);
  memset(&fault, 0, sizeof(fault));
#ifdef CONFIG_BK7258_RPTUN
  memset(&rptun, 0, sizeof(rptun));
#endif
  memset(&sem_wake, 0, sizeof(sem_wake));
  memset(&sem_loop, 0, sizeof(sem_loop));
  __asm volatile ("dmb sy" ::: "memory");
  if (shared_fault->magic == BK7258_AP_FAULT_STATE_MAGIC &&
      shared_fault->version == BK7258_AP_FAULT_STATE_VERSION &&
      shared_fault->size == sizeof(fault))
    {
      memcpy(&fault, (const void *)(uintptr_t)shared_fault, sizeof(fault));
    }

  memcpy(&cpu2, (const void *)(uintptr_t)shared_cpu2, sizeof(cpu2));
  memcpy(&ipi, (const void *)(uintptr_t)shared_ipi, sizeof(ipi));
  memcpy(&smp, (const void *)(uintptr_t)shared_smp, sizeof(smp));
  memcpy(&affinity, (const void *)(uintptr_t)shared_affinity,
         sizeof(affinity));
#ifdef CONFIG_BK7258_RPTUN
  if (shared_rptun->magic == BK7258_RPTUN_CONTROL_MAGIC &&
      shared_rptun->version == BK7258_RPTUN_CONTROL_VERSION &&
      shared_rptun->size == sizeof(rptun))
    {
      memcpy(&rptun, (const void *)(uintptr_t)shared_rptun, sizeof(rptun));
    }
#endif
  if (shared_sem_wake->magic == BK7258_AP_SEM_WAKE_STATE_MAGIC &&
      shared_sem_wake->version == BK7258_AP_SEM_WAKE_STATE_VERSION &&
      shared_sem_wake->size == sizeof(sem_wake))
    {
      memcpy(&sem_wake, (const void *)(uintptr_t)shared_sem_wake,
             sizeof(sem_wake));
    }

  if (shared_sem_loop->magic == BK7258_AP_SEM_WAKE_LOOP_STATE_MAGIC &&
      shared_sem_loop->version == BK7258_AP_SEM_WAKE_LOOP_STATE_VERSION &&
      shared_sem_loop->size == sizeof(sem_loop))
    {
      memcpy(&sem_loop, (const void *)(uintptr_t)shared_sem_loop,
             sizeof(sem_loop));
    }

  __asm volatile ("dmb sy" ::: "memory");
  printf("AP state=%s(%" PRIu32 ") error=%" PRIu32
         " generation=%" PRIu32 " heartbeat=%" PRIu32 "\n",
         apctl_state_name(state.state), state.state, state.error,
         state.generation, state.heartbeat);
  printf("AP core local=%" PRIu32 " physical=%" PRIu32
         " VTOR(init/run)=%08" PRIx32 "/%08" PRIx32
         " MSP(init/run)=%08" PRIx32 "/%08" PRIx32 "\n",
         state.local_core_id, state.physical_core_id,
         state.initial_vtor, state.runtime_vtor,
         state.initial_msp, state.runtime_msp);
  printf("AP clock=%" PRIu32 " SysTick ctrl/load/current=%08" PRIx32
         "/%08" PRIx32 "/%08" PRIx32 "\n",
         state.clock_hz, state.systick_ctrl,
         state.systick_reload, state.systick_current);
  printf("AP heap=%08" PRIx32 "..%08" PRIx32
         " test=%08" PRIx32 " doorbells cp/ap=%" PRIu32 "/%" PRIu32
         "\n", state.heap_start, state.heap_end, state.heap_test,
         state.cp_to_ap_doorbells, state.ap_to_cp_doorbells);

  if (fault.magic == BK7258_AP_FAULT_STATE_MAGIC)
    {
      printf("AP fault generation/exception=%" PRIu32 "/%" PRIu32
             " error=%" PRIu32 " EXCRET/SP=%08" PRIx32 "/%08" PRIx32
             "\n", fault.generation, fault.exception, fault.error,
             fault.exc_return, fault.stack_pointer);
      printf("AP fault HFSR/CFSR/MMFAR/BFAR=%08" PRIx32 "/%08" PRIx32
             "/%08" PRIx32 "/%08" PRIx32 "\n",
             fault.hfsr, fault.cfsr, fault.mmfar, fault.bfar);
      printf("AP fault PC/LR/xPSR=%08" PRIx32 "/%08" PRIx32
             "/%08" PRIx32 " R0/R1/R2/R3/R12=%08" PRIx32
             "/%08" PRIx32 "/%08" PRIx32 "/%08" PRIx32
             "/%08" PRIx32 "\n",
             fault.stacked_pc, fault.stacked_lr, fault.stacked_xpsr,
             fault.stacked_r0, fault.stacked_r1, fault.stacked_r2,
             fault.stacked_r3, fault.stacked_r12);
    }

#ifdef CONFIG_BK7258_RPTUN
  if (rptun.magic == BK7258_RPTUN_CONTROL_MAGIC &&
      rptun.version == BK7258_RPTUN_CONTROL_VERSION &&
      rptun.size == sizeof(rptun))
    {
      printf("RPTUN state=%s(%" PRIu32 ") error=%" PRIu32
             " generation=%" PRIu32 " flags=%08" PRIx32 "\n",
             apctl_rptun_state_name(rptun.state), rptun.state,
             rptun.error, rptun.generation, rptun.flags);
      printf("RPTUN pending cp/ap=%08" PRIx32 "/%08" PRIx32
             " heartbeat cp/ap=%" PRIu32 "/%" PRIu32
             " epoch cp/ap=%" PRIu32 "/%" PRIu32 "\n",
             rptun.cp_to_ap_pending, rptun.ap_to_cp_pending,
             rptun.cp_heartbeat, rptun.ap_heartbeat,
             rptun.cp_epoch, rptun.ap_epoch);
      printf("RPTUN rx sequence cp/ap=%" PRIu32 "/%" PRIu32 "\n",
             rptun.cp_rx_sequence, rptun.ap_rx_sequence);
    }
  else
    {
      printf("RPTUN state unavailable magic/version/size=%08" PRIx32
             "/%" PRIu32 "/%" PRIu32 "\n",
             rptun.magic, rptun.version, rptun.size);
    }
#endif

#ifdef CONFIG_BK7258_AP_SUPERVISOR
  (void)apctl_supervisor_status();
#endif

