open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_apctl_main.c
int main(int argc, char *argv[])
{
  uint32_t timeout;
  uint32_t count;
  uint32_t i;
  int ret = -EINVAL;

  if (argc < 2)
    {
      apctl_usage();
      return 1;
    }

  timeout = apctl_u32(argc > 2 ? argv[2] : NULL,
                      BK7258_AP_DEFAULT_TIMEOUT_MS);

  if (strcmp(argv[1], "start") == 0)
    {
      ret = bk7258_ap_start(timeout);
    }
  else if (strcmp(argv[1], "stop") == 0)
    {
      ret = bk7258_ap_stop(timeout);
    }
  else if (strcmp(argv[1], "restart") == 0)
    {
      ret = bk7258_ap_restart(timeout);
    }
  else if (strcmp(argv[1], "status") == 0)
    {
      apctl_status();
      return 0;
    }
#ifdef CONFIG_BK7258_AP_SUPERVISOR
  else if (strcmp(argv[1], "health") == 0)
    {
      return apctl_supervisor_status() < 0 ? 1 : 0;
    }
  else if (strcmp(argv[1], "recover") == 0)
    {
      ret = bk7258_ap_supervisor_recover(timeout);
    }
#  ifdef CONFIG_BK7258_AP_SUPERVISOR_FAULT_INJECTION
  else if (strcmp(argv[1], "inject") == 0)
    {
      uint32_t injection;

      if (argc < 3)
        {
          apctl_usage();
          return 1;
        }

      if (strcmp(argv[2], "primary") == 0)
        {
          injection = BK7258_AP_SUPERVISOR_INJECT_PRIMARY;
        }
      else if (strcmp(argv[2], "secondary") == 0)
        {
          injection = BK7258_AP_SUPERVISOR_INJECT_SECONDARY;
        }
      else if (strcmp(argv[2], "rpmsg") == 0)
        {
          injection = BK7258_AP_SUPERVISOR_INJECT_RPMSG;
        }
      else if (strcmp(argv[2], "clear") == 0)
        {
          injection = BK7258_AP_SUPERVISOR_INJECT_NONE;
        }
      else
        {
          apctl_usage();
          return 1;
        }

      ret = bk7258_ap_supervisor_inject(injection);
    }
#  endif
#endif
  else if (strcmp(argv[1], "ipitest") == 0)
    {
      count = apctl_u32(argc > 2 ? argv[2] : NULL,
                        BK7258_AP_IPI_DEFAULT_COUNT);
      timeout = apctl_u32(argc > 3 ? argv[3] : NULL,
                          BK7258_AP_IPI_DEFAULT_TIMEOUT_MS);
      ret = bk7258_ap_ipi_test(count, timeout);
    }
#ifdef CONFIG_BK7258_RPTUN_MBOX
  else if (strcmp(argv[1], "mbox") == 0)
    {
      count = apctl_u32(argc > 2 ? argv[2] : NULL, 32);
      timeout = apctl_u32(argc > 3 ? argv[3] : NULL, 1000);
      ret = bk7258_rptun_mbox_probe(count, timeout);
      if (ret >= 0)
        {
          printf("MBOX probe passed count=%" PRIu32
                 " timeout=%" PRIu32 " ms\n", count, timeout);
        }
    }
#endif
  else if (strcmp(argv[1], "cycle") == 0)
    {
      count = apctl_u32(argc > 2 ? argv[2] : NULL, 3);
      timeout = apctl_u32(argc > 3 ? argv[3] : NULL,
                          BK7258_AP_DEFAULT_TIMEOUT_MS);

      /* Normalize the entry state so every iteration is one complete
       * start/stop generation, including when cycle is invoked from READY.
       */

      ret = bk7258_ap_stop(timeout);
      for (i = 0; ret >= 0 && i < count; i++)
        {
          ret = bk7258_ap_start(timeout);
          if (ret < 0)
            {
              break;
            }

          apctl_status();
          ret = bk7258_ap_stop(timeout);
        }
    }
  else
    {
      apctl_usage();
      return 1;
    }

  apctl_status();
  if (ret < 0)
    {
      if (ret == -ENOTSUP)
        {
          fprintf(stderr,
                  "apctl: %s is disabled while AP scheduler-online mode "
                  "is active\n", argv[1]);
        }
      else
        {
          fprintf(stderr, "apctl: %s failed: %d\n", argv[1], ret);
        }

      return 1;
    }

  return 0;
}
